blogs/rsync-fake-super.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-14 六 07:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>编程思维-如何破解rsync -a不a的问题</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zhengzhiyong" />
<meta name="keywords" content="rsync strace file attr" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">编程思维-如何破解rsync -a不a的问题</h1>
<p>
rsync 有个 <code>-a</code> 参数，归档模式用于保证文件和文件stat都被复制。但是神奇的事情发生了。在rsync服务器上明明是root用户，rsync到本地之后变成了nobody，说好的 <code>-a</code> ，文件owner给我 <code>a</code> 哪去了。如何排查？
</p>

<div id="outline-container-orgddb8e53" class="outline-2">
<h2 id="orgddb8e53"><span class="section-number-2">1</span> 对比正常rsync服务器的配置</h2>
<div class="outline-text-2" id="text-1">
<p>
找了正常服务器的rsyncd.conf，对比无异常。配置无异常，说明不是服务端的问题，那也不能是客户端的问题，客户端没配置，只有参数。
</p>
</div>
</div>

<div id="outline-container-orgd49fcfb" class="outline-2">
<h2 id="orgd49fcfb"><span class="section-number-2">2</span> 对比rsync服务器的文件</h2>
<div class="outline-text-2" id="text-2">
<p>
在rsync服务器touch一个文件，rsync正常，owner被保留了，说明是文件的问题。哪文件到底出了什么问题，都是root，到底有啥不同呢？
</p>
</div>
</div>

<div id="outline-container-org8a9bb79" class="outline-2">
<h2 id="org8a9bb79"><span class="section-number-2">3</span> 复制异常文件</h2>
<div class="outline-text-2" id="text-3">
<p>
用 <code>cp</code> 复制异常文件，rsync正常，owner被保留了。用 <code>cp -a</code> 复制文件，rsync异常，owner变成了nobody。为什么？借助 <a href="https://zzyongx.github.io/blogs/strace-manual.html">strace</a> 发现有 <code>fsetxattr(4,"user.rsync.%stat","100755 0,0 1000:1000",20,0)=0</code> 这样的调用，问题肯定出在这儿。
</p>
</div>
</div>

<div id="outline-container-org713ae3d" class="outline-2">
<h2 id="org713ae3d"><span class="section-number-2">4</span> fake-super</h2>
<div class="outline-text-2" id="text-4">
<p>
rsync有fake-super参数，客户端和服务端都有，为啥要引入这个参数呢？因为rsync不是想a就能a的，它自己先得有权限。例如以非root从服务端rsync root文件，虽然rsync很想保留文件owner是root，但是它没权限呀，这样file的owner属性不就丢了吗？
</p>

<p>
所以rsync引入了fake-super参数，虽然没权限把文件改成owner，但是可以找个地方记下来文件的owner是root，记哪呢？答案是文件扩展属性。
</p>

<p>
下面的例子：因为zzyong没有nobody权限，所以nobody被记在了扩展属性中。注意，如果没有 <code>--fake-super</code> ，则不会记录扩展属性，owner没被保留，丢了。
</p>
<pre class="example">
# sudo -u zzyong rsync --fake-super -a rsync_server::backup/dbnet .
# ls -l
-rwxr-xr-x 1 zzyong zzyong 649842 Nov 27  2017 dbnet
# getfattr -d dbnet
# file: dbnet
user.rsync.%stat="100755 0,0 1000:1000"
</pre>

<p>
下面的例子：因为root有nobody权限，所以变成了nobody，注意这里没有 <code>--fake-super</code> ，并且扩展属性被清空了。
</p>
<pre class="example">
# rsync -a rsync_server::backup/dbnet .
# ls -l dbnet
-rwxr-xr-x 1 nobody nobody 649842 Nov 27  2017 dbnet
# getfattr dbnetget
</pre>

<p>
下面的例子：虽然root有nobody权限，但是使用了 <code>--fake-super</code> ，仍然是root，保留了扩展属性
</p>
<pre class="example">
# rsync --fake-super -a rsync_server::backup/dbnet .
# ls -l dbnet
-rwxr-xr-x 1 root root 649842 Nov 27  2017 dbnet
# getfattr dbnet
# file: dbnet
user.rsync.%stat="100755 0,0 1000:1000"
</pre>
</div>
</div>

<div id="outline-container-org89b20b3" class="outline-2">
<h2 id="org89b20b3"><span class="section-number-2">5</span> 问题原因</h2>
<div class="outline-text-2" id="text-5">
<p>
到这里原因基本找到了，因为文件rsync涉及多个业务，不知道哪个环节加了文件扩展属性，这个属性在合适的时候显露出来了。
</p>
</div>
</div>

<div id="outline-container-org571e989" class="outline-2">
<h2 id="org571e989"><span class="section-number-2">6</span> 总结</h2>
<div class="outline-text-2" id="text-6">
<p>
要看文件，仅仅看内容和stat的是不够的，必须考虑到其它<a href="https://zzyongx.github.io/blogs/file-attr.html">属性</a>。同样，要备份，仅仅cp是不够的，必须 <code>cp -a --preserve=all</code> 。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2020-11-14 六 07:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
